{"podcast_details": {"podcast_title": "AWS Morning Brief", "episode_title": "Dunking on Robots For InfoSec Clout", "episode_image": "https://images.transistor.fm/file/transistor/images/show/2513/full_1583955359-artwork.jpg", "episode_transcript": " This is the AWS Morning Brief Security Edition. AWS is fond of saying security is job zero. That means it's nobody in particular's job, which means it falls to the rest of us. Just the news you need to know, none of the fluff. Thankfully, DEF CON and its ill-behaved nonsense are safely in our rear-view mirror. There's some clean-up work in terms of CDEs to be done, but all in all, it was a pretty reasonable security season to my estimation, at least from a cloud perspective. Let's continue. It's been a while since I really took a step back and appreciated just how ridiculous the real AWS security offering landscape is. Cloudanaut has an overview of AWS's security monitoring services, along with handy ways to contextualize their various offerings. A deep exploration to how you can really screw up integrating GitHub with AWS. It's only through sheer dumb luck that I didn't fall victim to this back when I set up the integration on my stuff a couple of years back. And Chris Farris, newly-minted AWS security hero and security consultant to the Duckbill Group, talks about defining the sensitive IAM actions. This post touches on some of the things that are fairly reasonable, but also somewhat strange requirements got him thinking about in this vein. AWS has a post up called AWS Security Profile. Get to know the AWS Identity Solutions Team. This post begins, In this profile, I met with Ilya Epstein, senior manager of the AWS Identity Solutions Team, to talk about his team and what they're working on. Which is humorous, because a couple of weeks ago I went to New York and also met with Ilya. And this post rings true. He's a treasure and a delight, but just as in this post, he says, he spent the bulk of his time talking about what his team was doing, rather than what he personally was up to. There's a certain humility that's inherent to AWS in general, and Amazon Security in particular, that does them tremendous credit. In any case, go read about what they're up to. It's worth the time investment. CVE-2020-3-20569 RAS poisoning inception And that pairs with CVE-2020-40982, which was announced the same day from AWS. Because yes, it's DEF CON season. Both these announcements talk about yes, there's an exploit that's been discovered, and no, they don't apply to AWS. This is awesome, and I want to keep seeing more of these. Yes, it may get annoying and repetitive, but it's infinitely better than the failure mode of a big flashy new exploit has been released, and my cloud provider has nothing to say about the matter. Over-communicate these things, please. And tools. Avid is an AI vulnerability database. It's still very early days, but for the first time in recent memory, I'm seeing security vulnerabilities that include something I'm terrific at, cyberbullying a robot. R. Danil Alava weeps tears of rage in his bedroom. And apparently there's a whole mess of things you can screw up with OICD permissions, if you're not careful, as I mentioned a couple minutes ago. Tindersac fortunately threw up a scanner on GitHub, so you can see if you've fallen prey to one of the classic blunders. And that's what happened last week in AWS Security. I'm Cloud Economist Corey Quinn. Onward we go. Thank you for listening to the AWS Morning Brief Security Edition. For the latest in AWS security that actually matters, please follow AWS Morning Brief on Apple Podcasts, Spotify, Overcast, or wherever the hell it is you find the dulcet tones of my voice. And be sure to sign up for the Last Week in AWS newsletter at lastweekinaws.com."}, "podcast_summary": "In this podcast transcript, the host talks about various security topics related to AWS. They mention the overview of AWS's security monitoring services, the potential issues with integrating GitHub and AWS, and defining sensitive IAM actions. The host also discusses an AWS security profile and the humility of AWS and Amazon Security. They highlight the importance of over-communicating vulnerabilities and provide information on a vulnerability database called Avid. Lastly, the host mentions the OICD permissions issue and a scanner on GitHub to detect such blunders.", "podcast_guest": "Chris Farris", "podcast_highlights": "1. \"AWS Security Landscape: An Overview of Monitoring Services and Offerings\"\n2. \"Avoid Integration Issues: How GitHub and AWS Can Lead to Security Vulnerabilities\"\n3. \"AWS Security Hero Talks about Defining Sensitive IAM Actions\"\n4. \"Get to Know the AWS Identity Solutions Team: Insights from Senior Manager Ilya Epstein\"\n5. \"AWS Releases Security Updates: CVE-2020-3-20569 and CVE-2020-40982\"\n6. \"New AI Vulnerability Database Includes Cyberbullying a Robot: Avid's Early Days\"\n7. \"Avoid OICD Permission Blunders: GitHub Scanner Uncovers Potential Vulnerabilities\"\n\nNote: The headlines are suggestions based on the key highlights and insights highlighted in the podcast transcript."}